Catppuccin.catppuccin-vsc
charliermarsh.ruff
DavidAnson.vscode-markdownlint
eamodio.gitlens
James-Yu.latex-workshop
ms-python.black-formatter
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode.remote-explorer
PKief.material-icon-theme
rust-lang.rust-analyzer
tamasfe.even-better-toml
usernamehw.errorlens
vscodevim.vim
yzhang.markdown-all-in-one
mvllow.rose-pine
